hiperiondev/esp32idf_APRS/components/message/message.c
        char info[320];
        snprintf(info, sizeof(info), ":%s:%s{%u", toCallFixed, payload, (unsigned)s_queue[i].msgID);
        txPacket(myCall, info);
        ESP_LOGD(TAG, "Retry APRS message[%d] to %s msgID %u ack left %d", i, s_queue[i].callsign, (unsigned)s_queue[i].msgID, s_queue[i].ack);
    }
}

// ---------------------------------------------------------------------------
// Incoming
// ---------------------------------------------------------------------------
void handleIncomingAPRS(const char *line, query_source_t source) {
    const char *msgMarker = strstr(line, "::");
    if (msgMarker == NULL || msgMarker == line)
        return;

    char fromCall[16] = { 0 };
    const char *gt = strchr(line, '>');
    if (gt) {
        size_t n = (size_t)(gt - line);
        if (n >= sizeof(fromCall))
            n = sizeof(fromCall) - 1;
        memcpy(fromCall, line, n);
    }
    // Callsigns travel upper case on the air; normalising the sender here keeps
    // one spelling for the whole path it feeds - the queue entry the chat page
    // shows, the exact match that pairs an incoming ack with the outbound
    // message it acknowledges, and the addressee of the ack sent back.
    trimUpper(fromCall);

    const char *payload = msgMarker + 2;
    if (strlen(payload) < 10)
        return;

    char toCall[12] = { 0 };
    memcpy(toCall, payload, 9);
    trimUpper(toCall);

    if (strcasecmp(fromCall, toCall) == 0)
        return; // message to self, ignore

    const char *colon = strchr(payload + 9, ':');
    if (colon == NULL)
        return;

    // Directed query ("CALL:?query?") shares this same ":ADDRESSEE:" framing
    // but is not an APRS message: hand it to the query responder's own
    // addressee-parsing entry point instead of duplicating it here, and skip
    // the message-specific logic below entirely. Checked - and dispatched -
    // regardless of g_config.msg_enable, since the two features are
    // independently enabled (g_config.query_en gates it inside query.c).
    if (colon[1] == '?') {
        // The whole line goes along with the split-out fields: a "?APRST" /
        // "?PING?" answer reports the route the query travelled, which only
        // the unparsed line still carries. The source travels with it too,
        // since it decides both whether the query is answered and where the
        // answer goes.
        query_process_directed(fromCall, toCall, colon + 1, line, source);
        return;
    }

    if (!g_config.msg_enable)
        return;

    char message[300] = { 0 };
    strncpy(message, colon + 1, sizeof(message) - 1);
    // trim trailing whitespace/CR
    size_t mlen = strlen(message);
    while (mlen > 0 && isspace((unsigned char)message[mlen - 1]))
        message[--mlen] = 0;

    char msgNo[12] = { 0 };
    char *brace = strchr(message, '{');
    if (brace && brace[1]) {
        strncpy(msgNo, brace + 1, sizeof(msgNo) - 1);
        *brace = 0;
        mlen = strlen(message);
        while (mlen > 0 && isspace((unsigned char)message[mlen - 1]))
            message[--mlen] = 0;
    }

    bool isAck = (strncmp(message, "ack", 3) == 0);
    if (isAck)
        strncpy(msgNo, message + 3, sizeof(msgNo) - 1);

    bool isRej = (strncmp(message, "rej", 3) == 0);
    if (isRej)
        strncpy(msgNo, message + 3, sizeof(msgNo) - 1);

    ESP_LOGD(TAG, "Message from %s to %s: %s", fromCall, toCall, message);

    // Accept the message if the addressee's base callsign matches ours,
    // regardless of SSID on either side (message to "N0CALL", "N0CALL-7",
    // etc. is accepted as long as it's configured mycall is "N0CALL", with
    // or without its own SSID).
    if (!callsignBaseMatch(toCall, g_config.msg_mycall))
        return;

    // An ack or rej always carries a message ID (it's the ID of the queued
    // message being acknowledged/rejected); without one there is nothing to
    // match against a queued outgoing message, so it can't be processed.
    if ((isAck || isRej) && msgNo[0] == 0)
        return;

    if (isAck) {
        int i = pkgMsg_Find(fromCall, (uint16_t)atoi(msgNo), false);
        if (i >= 0)
            s_queue[i].ack = -2; // acked
        return;
    }

    if (isRej) {
        int i = pkgMsg_Find(fromCall, (uint16_t)atoi(msgNo), false);
        if (i >= 0)
            s_queue[i].ack = -3; // rejected by recipient: stop retrying, don't count as delivered
        return;
    }

    char decoded[300];
    strncpy(decoded, message, sizeof(decoded) - 1);
    decoded[sizeof(decoded) - 1] = 0;

    size_t dlen = strlen(decoded);
    while (dlen > 0 && isspace((unsigned char)decoded[dlen - 1]))
        decoded[--dlen] = 0;
    if (dlen == 0)
        return;

    // Every received message is a new line of the conversation and gets a queue
    // slot of its own; only a copy of one already in the history is left out,
    // and even then the ack below still goes back out, since a repeat means the
    // sender never heard the first one.
    uint16_t rxID = (uint16_t)atoi(msgNo);
    if (pkgMsgFindRepeat(fromCall, decoded, rxID, true) < 0)
        pkgMsgStore(fromCall, decoded, rxID, -1, true);
    // Per APRS101 the message ID is optional: only send an ack when the
    // sender actually requested one.
    if (msgNo[0] != 0)
        sendAPRSAck(fromCall, msgNo);
    message_alarm_pulse();
}
